#### GetDuplicateTypeNamesHandler Method

---

|  |
| --- |
| CopyPasteOptions Class   See Also |

Returns current duplicate type names handler or    a null reference (  Nothing  in Visual Basic)  if none is set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public IDuplicateTypeNamesHandler GetDuplicateTypeNamesHandler() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetDuplicateTypeNamesHandler As IDuplicateTypeNamesHandler ``` |

| Visual C++ |
| --- |
| ``` public: IDuplicateTypeNamesHandler^ GetDuplicateTypeNamesHandler() ``` |

# See Also

CopyPasteOptions Class

Autodesk.Revit.DB Namespace